## Assignment Two

### Importing Data

Below are a few examples of importing data. 

* Using the examples, import three different datasets, one from sklearn.datasets, one from seaborn.load_dataset, and one from pd.read_csv
* Print the shape of each dataset
* Show the information about the dataset using info()
* Show the first five rows of each dataset

In [2]:
# sklearn example
import pandas as pd
from sklearn.datasets import fetch_california_housing

housing = fetch_california_housing()
housing_df = pd.DataFrame(housing.data, columns=housing.feature_names)
housing_df['MedHouseVal'] = housing.target
print(housing_df.shape)
print(housing_df.info())
housing_df.head()

(20640, 9)
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 20640 entries, 0 to 20639
Data columns (total 9 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   MedInc       20640 non-null  float64
 1   HouseAge     20640 non-null  float64
 2   AveRooms     20640 non-null  float64
 3   AveBedrms    20640 non-null  float64
 4   Population   20640 non-null  float64
 5   AveOccup     20640 non-null  float64
 6   Latitude     20640 non-null  float64
 7   Longitude    20640 non-null  float64
 8   MedHouseVal  20640 non-null  float64
dtypes: float64(9)
memory usage: 1.4 MB
None

,MedInc,HouseAge,AveRooms,AveBedrms,Population,AveOccup,Latitude,Longitude,MedHouseVal
0,8.3252,41.0,6.984127,1.023810,322.0,2.555556,37.88,-122.23,4.526
1,8.3014,21.0,6.238137,0.971880,2401.0,2.109842,37.86,-122.22,3.585
2,7.2574,52.0,8.288136,1.073446,496.0,2.802260,37.85,-122.24,3.521
3,5.6431,52.0,5.817352,1.073059,558.0,2.547945,37.85,-122.25,3.413
4,3.8462,52.0,6.281853,1.081081,565.0,2.181467,37.85,-122.25,3.422

In [4]:
# seaborn example
import seaborn as sns

mpg = sns.load_dataset('mpg')
print(mpg.shape)
print(mpg.info())
mpg.head()

(398, 9)
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 398 entries, 0 to 397
Data columns (total 9 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   mpg           398 non-null    float64
 1   cylinders     398 non-null    int64
 2   displacement  398 non-null    float64
 3   horsepower    392 non-null    float64
 4   weight        398 non-null    int64
 5   acceleration  398 non-null    float64
 6   model_year    398 non-null    int64
 7   origin        398 non-null    object
 8   name          398 non-null    object
dtypes: float64(4), int64(3), object(2)
memory usage: 28.1+ KB
None

,mpg,cylinders,displacement,horsepower,weight,acceleration,model_year,origin,name
0,18.0,8,307.0,130.0,3504,12.0,70,usa,chevrolet chevelle malibu
1,15.0,8,350.0,165.0,3693,11.5,70,usa,buick skylark 320
2,18.0,8,318.0,150.0,3436,11.0,70,usa,plymouth satellite
3,16.0,8,304.0,150.0,3433,12.0,70,usa,amc rebel sst
4,17.0,8,302.0,140.0,3449,10.5,70,usa,ford torino

In [5]:
# csv example
import pandas as pd

retail = pd.read_csv('Retail_Data.csv')
print(retail.shape)
print(retail.info())
retail.head()

(100, 6)
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 100 entries, 0 to 99
Data columns (total 6 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   Retailer      100 non-null    int64
 1   Zone          100 non-null    object
 2   Retailer_Age  100 non-null    object
 3   Perindex      99 non-null     float64
 4   Growth        100 non-null    float64
 5   NPS_Category  100 non-null    object
dtypes: float64(2), int64(1), object(3)
memory usage: 4.8+ KB
None

   Retailer   Zone Retailer_Age  Perindex  Growth NPS_Category
0         1  North          <=2     81.84    3.04     Promoter
1         2   East       2 to 5     53.22    4.22    Detractor
2         3   West           >5     85.33    6.73     Promoter
3         4   West           >5     82.00    1.56     Promoter
4         5  South       2 to 5     64.35    2.71    Detractor